In [1]:
import pandas as pd

data = {"Name":["Ankit Gupta", "Ajay Verma","Raj Sharma",'Riya Singh'],
       "Age":[34,23,33,28]}

df = pd.DataFrame(data)
df

          Name  Age
0  Ankit Gupta   34
1   Ajay Verma   23
2   Raj Sharma   33
3   Riya Singh   28

In [6]:
df[["First Name", 'Last Name']] = df["Name"].str.split(" ",expand = True)
df

          Name  Age First Name Last Name
0  Ankit Gupta   34      Ankit     Gupta
1   Ajay Verma   23       Ajay     Verma
2   Raj Sharma   33        Raj    Sharma
3   Riya Singh   28       Riya     Singh

In [5]:
a = "new delhi"
print(a.split())

['new', 'delhi']